# -*- coding: utf-8 -*-
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# bun
# cutlet
# cucumber
# tomato
# mayonnaise
# cheese onion dill dill
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def bun():
    print('Добавим булочку')


def cutlet():
    print('Добавим котлету')


def cucumber():
    print('Добавим огурчик')


def tomato():
    print('Добавим помидорчик')


def mayonnaise():
    print('Добавим мазик')


def cheese():
    print('Добавим сыр')


def onion():
    print('Добавим лучок')


def dill():
    print('Добавим укропчик')


def mustard():
    print('Добавим горчицу ')


def salad():
    print('Добавим лист салата')
